
# EDA Internship Task Week 2

# IMPORT LIBRARIES

In [1]:
import pandas as pd

## QUESTION NO 1:
### Writer pandas series code to get following output without using dictionary:

In [2]:
data = [1, 4, 9, 6, 7]
index = ['a', 'x', 'c', '2','e']

series = pd.Series(data, index=index, dtype='int64')

print(series)

a    1
x    4
c    9
2    6
e    7
dtype: int64

## QUESTION NO 2:
### Writer pandas series code to get following output without using dictionary:

In [3]:
data2 = [42,38,39]
index2 = ['Bilal', 'Ayesha', 'Hadia']

series = pd.Series(data2, index=index2,dtype='int64')

print(series)

Bilal     42
Ayesha    38
Hadia     39
dtype: int64

## QUESTION NO 3:
### Writer pandas series code to get following output:

In [4]:

data = {'day': ['1/1/2017', '1/2/2017', '1/3/2017', '1/4/2017','1/5/2017','1/6/2017'],
        'temperature': [32, 35, 28, 24,32,31],
        'windspeed': [6, 7, 2, 7,4,2],
        'event': ['Rain','Sunny', 'Snow', 'Snow', 'Rain','Sunny']}

# Creating a DataFrame
df = pd.DataFrame(data)

# Display the DataFrame
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

## QUESTION NO 4:
### In extension to above question, you are required to replace index by ['a','b','c','d','e','f']

In [5]:
df.index=['a','b','c','d','e','f']
df

        day  temperature  windspeed  event
a  1/1/2017           32          6   Rain
b  1/2/2017           35          7  Sunny
c  1/3/2017           28          2   Snow
d  1/4/2017           24          7   Snow
e  1/5/2017           32          4   Rain
f  1/6/2017           31          2  Sunny

## QUESTION NO 5:
### In extension to above Q.3, calculate mean, miximum and minimum for label “temperature”

In [6]:
temperature_mean = df['temperature'].mean()
temperature_max = df['temperature'].max()
temperature_min = df['temperature'].min()

# Display the results
print(f"Mean Temperature: {temperature_mean}")
print(f"Maximum Temperature: {temperature_max}")
print(f"Minimum Temperature: {temperature_min}")

Mean Temperature: 30.333333333333332
Maximum Temperature: 35
Minimum Temperature: 24

## QUESTION NO 6:
### Import CSV ‘people.csv’ in the given folder. 
### Keep in mind the following instructions:
### You’re required to import only specific columns ["First Name", "Sex", "Email", “Phone”, “Job Title”]
### Set the following columns ["Sex", "Job Title"] as index columns
### Skip following rows [1,5]
### Export the CSV as “NewPeople.csv”

In [7]:
data_people = pd.read_csv('people.csv', usecols=["First Name", "Sex", "Email", "Phone", "Job Title"], skiprows=[1, 5])
data_people

,First Name,Sex,Email,Phone,Job Title
0,Phillip,Female,bethany14@example.com,214.112.6044x4913,Phytotherapist
1,Kristine,Male,bthompson@example.com,277.609.7938,Homeopath
2,Yesenia,Male,kaitlinkaiser@example.com,584.094.6111,Market researcher
3,Erin,Male,tconner@example.org,001-171-649-9856x5553,Waste management officer
4,Katherine,Female,conniecowan@example.com,+1-773-151-6685x49162,Intelligence analyst
...,...,...,...,...,...
93,Dennis,Female,bmartin@example.org,001-095-524-2112x257,Software engineer
94,Steve,Female,latasha46@example.net,001-865-478-5157,Barrister
95,Wesley,Male,regina11@example.org,995-542-3004x76800,Police officer
96,Summer,Female,alexiscantrell@example.org,001-273-685-6932x092,Broadcast journalist
97,Mariah,Male,pcopeland@example.org,(341)594-6554x44657,IT sales professional

In [8]:
# Set "Sex" and "Job Title" as index columns
data_people.set_index(["Sex", "Job Title"], inplace=True)
data_people

                                First Name                       Email  \
Sex    Job Title
Female Phytotherapist              Phillip       bethany14@example.com
Male   Homeopath                  Kristine       bthompson@example.com
       Market researcher           Yesenia   kaitlinkaiser@example.com
       Waste management officer       Erin         tconner@example.org
Female Intelligence analyst      Katherine     conniecowan@example.com
...                                    ...                         ...
       Software engineer            Dennis         bmartin@example.org
       Barrister                     Steve       latasha46@example.net
Male   Police officer               Wesley        regina11@example.org
Female Broadcast journalist         Summer  alexiscantrell@example.org
Male   IT sales professional        Mariah       pcopeland@example.org

                                                 Phone
Sex    Job Title
Female Phytotherapist                214.112.6044x4913
Male   Homeopath                          277.609.7938
       Market researcher                  584.094.6111
       Waste management officer  001-171-649-9856x5553
Female Intelligence analyst      +1-773-151-6685x49162
...                                                ...
       Software engineer          001-095-524-2112x257
       Barrister                      001-865-478-5157
Male   Police officer               995-542-3004x76800
Female Broadcast journalist       001-273-685-6932x092
Male   IT sales professional       (341)594-6554x44657

[98 rows x 3 columns]

In [9]:
# Export the DataFrame to a new CSV file named 'NewPeople.csv'
export_file_path = 'NewPeople.csv'
data_people.to_csv(export_file_path)

print("Data exported successfully to 'NewPeople.csv'")

Data exported successfully to 'NewPeople.csv'

## QUESTION NO 7
### Import excel sheet ‘SampleWork.xlsx’ in the given folder. Keep in mind the following instructions:
### Import sheet 1
### Import only first and last column from sheet 1
### Skip row 2 while importing the sheet
### Set row 2 as header
### export as new sheet.

In [10]:
sample_work_df='SampleWork.xlsx'
sample_work_df = pd.read_excel('SampleWork.xlsx', sheet_name=0, usecols=[0, -1], skiprows=[1], header=1)
sample_work_df

    Bilal
0  Sufyan
1   Saiqa
2   Aimen

In [11]:
# Export the DataFrame to a new Excel sheet named 'NewSheet'
export_file_path = 'NewSheet.xlsx'
sample_work_df.to_excel(export_file_path, index=False)

print("Data exported successfully to 'NewSheet.xlsx'")

Data exported successfully to 'NewSheet.xlsx'

## QUESTION NO 8: 
### Create the following dataframe as AICP_DF then implement different operations as described below:
### select 'Name', 'Qualification' coloumns and save to df1 add a new column to AICP_DF “Height” with the following values: [5.1, 6.2, 5.1, 5.2,5.1]
### set column “Name” as the index column.
### retrieve row with index “Hifza”
### retrieve row with index 3
### drop row with index “Bilal”

In [12]:

data5 = {'Name': ['Sonia', 'Bilal', 'Hifza', 'Kabir', 'Jazim'],
        'Age': [27,24,22,32,23],
        'Address': ['Lahore','Karachi','Sialkot','Peshawr','lhr'],
        'Qualification': ['Msc', 'MA', 'MCA', 'Phd', 'Bsc'],}

# Creating a DataFrame
AICP_DF = pd.DataFrame(data5)

# Display the DataFrame
AICP_DF

    Name  Age  Address Qualification
0  Sonia   27   Lahore           Msc
1  Bilal   24  Karachi            MA
2  Hifza   22  Sialkot           MCA
3  Kabir   32  Peshawr           Phd
4  Jazim   23      lhr           Bsc

In [13]:
# Selecting 'Name', 'Qualification' columns and saving to df1
df1 = AICP_DF[['Name', 'Qualification']]

In [14]:
# Adding a new column "Height" to AICP_DF
AICP_DF['Height'] = [5.1, 6.2, 5.1, 5.2, 5.1]

In [15]:
# Setting column "Name" as the index column
AICP_DF.set_index('Name', inplace=True)

In [16]:
# Retrieving row with index "Hifza"
row_hifza = AICP_DF.loc['Hifza']

In [17]:
# Retrieving row with index 3
row_index_3 = AICP_DF.iloc[3]

In [18]:
# Dropping row with index "Bilal"
AICP_DF.drop('Bilal', inplace=True)

In [19]:
# Displaying the DataFrames and results
print("AICP_DF:")
(AICP_DF)

AICP_DF:

       Age  Address Qualification  Height
Name
Sonia   27   Lahore           Msc     5.1
Hifza   22  Sialkot           MCA     5.1
Kabir   32  Peshawr           Phd     5.2
Jazim   23      lhr           Bsc     5.1

In [20]:
print("\ndf1:")
df1

df1:

    Name Qualification
0  Sonia           Msc
1  Bilal            MA
2  Hifza           MCA
3  Kabir           Phd
4  Jazim           Bsc

In [21]:
print ("\nRow with index 'Hifza':")
row_hifza

Row with index 'Hifza':

Age                   22
Address          Sialkot
Qualification        MCA
Height               5.1
Name: Hifza, dtype: object

In [22]:
print("\nRow with index 3:")
row_index_3

Row with index 3:

Age                   32
Address          Peshawr
Qualification        Phd
Height               5.2
Name: Kabir, dtype: object